cf/Enums/ВариантДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВариантДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СамовывозСНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоГрузоперевозчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоКлиентаНашимиСилами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозСоСкладаПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СамовывозСТерминала</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоСкладаТК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставкаДоСкладаПоставщиком</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Enums/ВариантДоставки/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ссылка") И ТипЗнч(Параметры.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда 
		Возврат;
	Иначе 
		СтандартнаяОбработка = Ложь;
		ДанныеВыбора = Новый СписокЗначений;
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика,  Строка(Перечисления.ВариантДоставки.ДоставкаДоГрузоперевозчика));
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.ДоставкаДоКлиента, Строка(Перечисления.ВариантДоставки.ДоставкаДоКлиента));
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами, Строка(Перечисления.ВариантДоставки.ДоставкаДоКлиентаНашимиСилами));
		ДанныеВыбора.Добавить(Перечисления.ВариантДоставки.СамовывозСНашегоСклада, Строка(Перечисления.ВариантДоставки.СамовывозСНашегоСклада));
	КонецЕсли;
	
КонецПроцедуры
